Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.67/samv70/edc/ATSAMV70J19.PIC
      <edc:AdjustPoint edc:_addr="0x400640A4" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x400640D0" edc:access="-------------------------------n" edc:cname="AFEC1_COSR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Sample &amp; Hold unit Correction Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400640D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC1_CVR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400640D8" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC1_CECR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:desc="Error Correction Enable for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:desc="Error Correction Enable for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:desc="Error Correction Enable for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:desc="Error Correction Enable for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:desc="Error Correction Enable for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:desc="Error Correction Enable for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:desc="Error Correction Enable for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:desc="Error Correction Enable for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:desc="Error Correction Enable for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:desc="Error Correction Enable for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:desc="Error Correction Enable for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:desc="Error Correction Enable for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400640DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400640E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="AFEC1_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect KEY" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400640E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="AFEC1_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protect Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protect Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400640EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40068000" edc:access="--------------nnnn-n----n-nnnn-n" edc:cname="MLB_MLBC0" edc:impl="0x3D0BD" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MLBEN" edc:desc="MediaLB Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLBCLK" edc:desc="MLBCLK (MediaLB clock) speed select" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_256_FS" edc:desc="256xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_512_FS" edc:desc="512xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_1024_FS" edc:desc="1024xFs (for MLBPEN = 0)" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="Must be Written to 0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLBLK" edc:desc="MediaLB Lock Status (read-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ASYRETRY" edc:desc="Asynchronous Tx Packet Retry" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTLRETRY" edc:desc="Control Tx Packet Retry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCNT" edc:desc="The number of frames per sub-buffer for synchronous channels" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_1_FRAME" edc:desc="1 frame per sub-buffer (Operation is the same as Standard mode.)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_FRAMES" edc:desc="2 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_FRAMES" edc:desc="4 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_FRAMES" edc:desc="8 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_FRAMES" edc:desc="16 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32_FRAMES" edc:desc="32 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_64_FRAMES" edc:desc="64 frames per sub-buffer" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40068004" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4006800C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MS0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MCS" edc:desc="MediaLB Channel Status [31:0] (cleared by writing a 0)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
